python format

In [ ]:
folder = '/content/drive/MyDrive'
data = pd.read_csv(f'{folder}/SNA/ddt/0_ddt_content.csv')

python duplicated

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.duplicated.html

In [ ]:
df = pd.DataFrame({
    'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    'rating': [4, 4, 3.5, 15, 5]
})

In [ ]:
df

     brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [ ]:
df.duplicated('brand') #檢查有沒有重複

0    False
1     True
2    False
3     True
4     True
dtype: bool

In [ ]:
df[df.duplicated('brand')] #列出有重複的

     brand style  rating
1  Yum Yum   cup     4.0
3  Indomie  pack    15.0
4  Indomie  pack     5.0

python isin

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.isin.html

In [ ]:
df = pd.DataFrame({
    'a': [2, 4, 3, 4], 
    'b': [2, 0, 2, 4],
    'c': [1, 9, 11, 74],
    'd': [3, 7, 22, 44]},
    index=['A', 'B' , 'C', 'D'])

In [ ]:
df

   a  b   c   d
A  2  2   1   3
B  4  0   9   7
C  3  2  11  22
D  4  4  74  44

In [ ]:
df.isin([0,1,2,3,4,5,6,7,8,9])  #核對有沒有一樣的內容

      a     b      c      d
A  True  True   True   True
B  True  True   True   True
C  True  True  False  False
D  True  True  False  False

In [ ]:
df['d'].isin([0,1,2,3,4,5,6,7,8,9])

A     True
B     True
C    False
D    False
Name: d, dtype: bool

set

In [ ]:
set(df['a']) #轉成{ }結構 直接用set比較快

{2, 3, 4}

In [ ]:
df['a'].unique() #找出不重複的內容 以array表示

array([2, 4, 3])

set 運算

In [ ]:
{1,2,3,4,5,6,7,8} - {1,3,5,7}

{2, 4, 6, 8}

drop_duplicates 去除重複內容

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.drop_duplicates.html

In [ ]:
df = pd.DataFrame({
    'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    'rating': [4, 4, 3.5, 15, 5]
})

In [ ]:
df

     brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [ ]:
df.drop_duplicates() #整筆一樣的去除

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [ ]:
df.drop_duplicates(subset=['brand']) #去掉brand一樣的

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5